/*******************************************************************************
****蓝旗嵌入式系统 STM8S105 EasyKit
****LENCHIMCU.TAOBAO.COM
****版本:V1.0
****日期:14-2-2014
****说明:主芯片STM8S105C4T6
********************************************************************************/
#include "include.h"

#include "IO.h"

#include "DriveRelay.h"

//  定义IO名称

/*******************************************************************************
****函数名称:
****函数功能:初始化LED接口
****版本:V1.0
****日期:14-2-2014
****入口参数:需要初始化的LED
取值下列值之一或者它们之间的“或运算”组合形式
            LED1
            LED2
            LED3
****出口参数:无
****说明:
********************************************************************************/
void IO_DeInit(void)
{
  GPIO_DeInit(GPIOA);
GPIO_DeInit(GPIOB);
GPIO_DeInit(GPIOC);
GPIO_DeInit(GPIOD);
GPIO_DeInit(GPIOE);
GPIO_DeInit(GPIOF);
GPIO_DeInit(GPIOG);
}



void IO_Init(IO_TypeDef x)
{
  GPIO_Init(x.PORT, x.PIN, GPIO_MODE_OUT_PP_LOW_FAST);
   }

/*******************************************************************************
****函数名称:
****函数功能:点亮LED
****版本:V1.0
****日期:14-2-2014
****入口参数:需要点亮的LED
取值下列值之一或者它们之间的“或运算”组合形式
            LED1
            LED2
            LED3
****出口参数:无
****说明:
********************************************************************************/
void LED_On(u8 LedNum)
{

   
}
/*******************************************************************************
****函数名称:
****函数功能:熄灭LED
****版本:V1.0
****日期:14-2-2014
****入口参数:需要熄灭的LED
取值下列值之一或者它们之间的“或运算”组合形式
            LED1
            LED2
            LED3
****出口参数:无
****说明:
********************************************************************************/
void LED_Off(u8 LedNum)
{
  
   
}
/*******************************************************************************
****函数名称:
****函数功能:翻转LED
****版本:V1.0
****日期:14-2-2014
****入口参数:需要翻转的LED
取值下列值之一或者它们之间的“或运算”组合形式
            LED1
            LED2
            LED3
****出口参数:无
****说明:
********************************************************************************/
void LED_Toggle(u8 LedNum)
{
  
   
}


/******************* (C) COPYRIGHT 2014 LENCHIMCU.TAOBAO.COM ******************/